# St7SetBrickCreepLoadingAge1

Assigns a creep loading age for the specified brick.

long St7SetBrickCreepLoadingAge1(long uID, long BrickNum, double* Doubles)

Input Parameters

uID

Strand7 model file ID.

BrickNum

Brick number.

Doubles[0]

Creep loading age in seconds.